				Implementation Notes

** Think about design
   CLOCK: [2013-04-24 Wed 12:20]--[2013-04-24 Wed 18:20] =>  6:00
** DONE Try compiling with the JGraphT jar
   CLOCK: [2013-04-24 Wed 18:22]--[2013-04-24 Wed 19:19] =>  0:57
*** Mock project
    CLOCK: [2013-04-24 Wed 21:33]--[2013-04-24 Wed 21:33] =>  0:00
    CLOCK: [2013-04-24 Wed 19:19]--[2013-04-24 Wed 20:49] =>  1:30
*** Inliner
    CLOCK: [2013-04-24 Wed 21:43]--[2013-04-24 Wed 21:56] =>  0:13
**** DONE make compile
     CLOCK: [2013-04-24 Wed 21:56]--[2013-04-24 Wed 22:19] =>  0:23
**** DONE make test
     CLOCK: [2013-04-24 Wed 22:19]--[2013-04-25 Thu 00:29] =>  2:10
**** DONE jtb
     CLOCK: [2013-04-25 Thu 00:31]--[2013-04-25 Thu 01:20] =>  0:49
** DONE Write build.xml for Concurrent Programming project direct
   CLOCK: [2013-04-25 Thu 16:50]--[2013-04-25 Thu 17:07] =>  0:17
** DONE Flesh out Basic classes
   CLOCK: [2013-04-25 Thu 19:30]--[2013-04-25 Thu 19:39] =>  0:09
*** Activation
    CLOCK: [2013-04-25 Thu 19:40]--[2013-04-25 Thu 19:43] =>  0:03
*** Continuation Base class
    CLOCK: [2013-04-26 Fri 00:19]--[2013-04-26 Fri 00:19] =>  0:00
    CLOCK: [2013-04-25 Thu 21:54]--[2013-04-25 Thu 22:09] =>  0:15
*** Fib
    CLOCK: [2013-04-26 Fri 00:19]--[2013-04-26 Fri 00:25] =>  0:06
    CLOCK: [2013-04-25 Thu 21:44]--[2013-04-25 Thu 21:54] =>  0:10
*** DONE FibTest
    CLOCK: [2013-04-26 Fri 00:33]--[2013-04-26 Fri 01:07] =>  0:34
    CLOCK: [2013-04-26 Fri 00:19]--[2013-04-26 Fri 00:33] =>  0:14
*** DONE Just realized I need a Stack, not a queue, for my trivial Scheduler.
    CLOCK: [2013-04-26 Fri 01:07]--[2013-04-26 Fri 01:12] =>  0:05
** DONE Add @Override annotations
   CLOCK: [2013-04-26 Fri 01:12]--[2013-04-26 Fri 01:13] =>  0:01
*** DONE import jgrapht stuff
    CLOCK: [2013-04-26 Fri 01:13]--[2013-04-26 Fri 02:02] =>  0:49
    :PROPERTIES:
    :Effort:   5
    :END:
*** DONE test Graph stuff
    CLOCK: [2013-04-26 Fri 02:02]--[2013-04-26 Fri 02:46] =>  0:44

**** DONE make continuation out of your test code
     CLOCK: [2013-04-26 Fri 02:46]--[2013-04-26 Fri 03:00] =>  0:14
** DONE Make sure you remove later from the graph only after now
   CLOCK: [2013-04-26 Fri 03:00]--[2013-04-26 Fri 03:30] =>  0:30
*** DONE Changing the Graph changes the set returned by vertexSet()
    CLOCK: [2013-04-27 Sat 16:36]--[2013-04-27 Sat 18:17] =>  1:41
*** DONE Remove Stack stuff
    CLOCK: [2013-04-27 Sat 18:17]--[2013-04-27 Sat 18:35] =>  0:18
*** DONE addEdge => addTask
    CLOCK: [2013-04-27 Sat 18:35]--[2013-04-27 Sat 18:40] =>  0:05
** DONE Thread pool
   CLOCK: [2013-04-27 Sat 18:40]--[2013-04-27 Sat 18:59] =>  0:19
*** DONE Make Continuations implement Runnable
    CLOCK: [2013-04-27 Sat 18:59]--[2013-04-27 Sat 19:05] =>  0:06
*** DONE Printlining for Activation
    CLOCK: [2013-04-27 Sat 19:05]--[2013-04-27 Sat 19:35] =>  0:30
*** DONE think about thread stuff and contracts
    CLOCK: [2013-04-27 Sat 19:35]--[2013-04-27 Sat 21:30] =>  1:55
*** DONE try assert
    CLOCK: [2013-04-27 Sat 22:56]--[2013-04-27 Sat 23:18] =>  0:22
*** DONE put assert for areTasksRemaining, etc.
    CLOCK: [2013-04-27 Sat 23:18]--[2013-04-27 Sat 23:26] =>  0:08
*** DONE Use ThreadPool
    CLOCK: [2013-04-27 Sat 23:30]--[2013-04-28 Sun 02:06] =>  2:36
*** DONE HUGE BUG: Scheduler should remove the current task only AFTER it has finished running NOT immediately after it has been scheduled.
    CLOCK: [2013-04-28 Sun 02:06]--[2013-04-28 Sun 02:27] =>  0:21
**** What do I do? (Concurrent Modification Error)
     CLOCK: [2013-04-28 Sun 02:27]--[2013-04-28 Sun 03:12] =>  0:45
**** Right now, go for a simple Lock on taskGraph - Not working out. Am gonna go through all the methods to check where the concurrent modification is happening
     CLOCK: [2013-04-28 Sun 21:30]--[2013-04-28 Sun 21:40] =>  0:10
*** DONE Recheck contracts for all methods
    CLOCK: [2013-04-28 Sun 21:40]--[2013-04-28 Sun 22:00] =>  0:20
**** TODO See if left -> right -> sum works concurrently
     CLOCK: [2013-04-28 Sun 22:00]--[2013-04-28 Sun 22:13] =>  0:13
**** DONE Solution: Add a =isScheduled= field to Activation
     CLOCK: [2013-04-28 Sun 22:13]--[2013-04-28 Sun 22:23] =>  0:10
*** DONE Test linear schedule.
    CLOCK: [2013-04-29 Mon 00:53]--[2013-04-29 Mon 00:55] =>  0:02
    CLOCK: [2013-04-28 Sun 22:26]--[2013-04-28 Sun 23:10] =>  0:44
***** Have a listener on the graph
      CLOCK: [2013-04-28 Sun 23:10]--[2013-04-28 Sun 23:39] =>  0:29
***** When an edge is removed, check if the destination node's degree becomes zero.
      CLOCK: [2013-04-28 Sun 23:41]--[2013-04-28 Sun 23:58] =>  0:17
*** DONE Test without the assert -> works sometimes
    CLOCK: [2013-04-29 Mon 01:17]--[2013-04-29 Mon 01:27] =>  0:10
*** DONE Ensure that contracts for methods hold after adding the isScheduled field and after ReadyNodeListener
    CLOCK: [2013-04-29 Mon 00:38]--[2013-04-29 Mon 00:53] =>  0:15
    CLOCK: [2013-04-29 Mon 00:22]--[2013-04-29 Mon 00:38] =>  0:16
*** DONE Test with non-linear schedule 
    CLOCK: [2013-04-29 Mon 00:55]--[2013-04-29 Mon 01:17] =>  0:22
    CLOCK: [2013-04-28 Sun 22:24]--[2013-04-28 Sun 22:26] =>  0:02
*** DONE Try with synchronized blocks
    CLOCK: [2013-04-29 Mon 02:05]--[2013-04-29 Mon 02:26] =>  0:21
*** DONE Try fib with k = 15
    CLOCK: [2013-04-29 Mon 02:26]--[2013-04-29 Mon 02:44] =>  0:18
**** DONE I think it might be because an assert fails in the other thread => Deadlock
     CLOCK: [2013-04-29 Mon 02:44]--[2013-04-29 Mon 02:44] =>  0:00
***** Remove all asserts that can run in other threads
      CLOCK: [2013-04-29 Mon 02:44]--[2013-04-29 Mon 02:59] =>  0:15
***** DONE Try catching RuntimeException in Activation to see the Stack Trace in non-main threads - Master Stroke
      CLOCK: [2013-04-29 Mon 02:59]--[2013-04-29 Mon 03:02] =>  0:03
***** DONE Quick check: put a +sleep+ long for loop between the two. i.e., force the error -> Confirmed
      CLOCK: [2013-04-29 Mon 03:32]--[2013-04-29 Mon 03:36] =>  0:04
***** DONE How to make sure the newly added task isn't picked before its edges are added?
      CLOCK: [2013-04-29 Mon 03:37]--[2013-04-29 Mon 03:44] =>  0:07
** DONE Damn. Stack trace for Exceptions in other threads is now not being printed. Why?
   CLOCK: [2013-04-29 Mon 11:02]--[2013-04-29 Mon 12:12] =>  1:10
*** DONE define unique equals for Activation
    CLOCK: [2013-04-29 Mon 12:17]--[2013-04-29 Mon 12:19] =>  0:02
**** equals for Continuation
     CLOCK: [2013-04-29 Mon 12:19]--[2013-04-29 Mon 12:25] =>  0:06
**** DONE I think I'll just go with a unique id for each Activation
     CLOCK: [2013-04-29 Mon 12:25]--[2013-04-29 Mon 12:32] =>  0:07
** TODO Why not have a set of ready nodes? -> Maybe use this if the synchronized blocks in getReadyNode cause performance degradation.
   CLOCK: [2013-04-29 Mon 10:19]--[2013-04-29 Mon 11:02] =>  0:43
   CLOCK: [2013-04-29 Mon 01:27]--[2013-04-29 Mon 01:55] =>  0:28
